/**
  ******************************************************************************
  * @file           : 
  * @brief         : 
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <main.h>
#include <RteTim.h>
#include <RteCom.h>
#include <RteAdc.h>
#include <AscCom.h>
#include <AscPWM.h>
#include <AscCDD.h>
/* Macro -------------------------------------------------------------*/
#define ON 	1
#define OFF 0

/* Typedef -----------------------------------------------------------*/
void TaskManager(void);
void Task1S(void);		//1초간격 수행루틴
void Task100mS(void);		//0.1초간격 수행루틴
void Task10mS(void);		//0.01초간격 수행루틴
void Task1mS(void);		//0.001초간격 수행루틴

void SET_PWM_VOL(unsigned char ch, unsigned int POW);
/* Variables ---------------------------------------------------------*/
/* Code here ---------------------------------------------------------*/

/* End Code ---------------------------------------------------------*/
